gnaoh05/Nhom_3_FSOFT_STM32_Mem_MCAL_Generator/AUTOSAR_MEM/Test/Core/TestManager.c
#include <Stm32F401_BareMetal.h>
#include "TestManager.h"

#include "Init_Test.h"
#include "Det_Test.h"
#include "Status_Test.h"
#include "Read_Test.h"
#include "Write_Test.h"
#include "Erase_Test.h"
#include "BlankCheck_Test.h"
#include "Job_Test.h"
#include "Boundary_Test.h"

#define TEST_REPORT_SIGNATURE       0x54455354UL
#define TEST_INVALID_INDEX          0xFFFFFFFFUL
#define TEST_LED_PIN_MASK           (1UL << 5u)
#define TEST_SCB_CFSR               (*(volatile uint32*)0xE000ED28UL)
#define TEST_SCB_HFSR               (*(volatile uint32*)0xE000ED2CUL)
#define TEST_SCB_MMFAR              (*(volatile uint32*)0xE000ED34UL)
#define TEST_SCB_BFAR               (*(volatile uint32*)0xE000ED38UL)

extern uint32 _sidata;
extern uint32 _sdata;
extern uint32 _edata;

volatile TestReportType g_TestReport;

TestSectorConfigType g_CurrentTestSector = {
    7u,
    0x08060000UL,
    0x00020000UL
};

static const TestSectorConfigType g_SafeTestSectors[] = {
    { 3u, 0x0800C000UL, 0x00004000UL }, /* Sector 3 - 16 KB  */
    { 4u, 0x08010000UL, 0x00010000UL }, /* Sector 4 - 64 KB  */
    { 5u, 0x08020000UL, 0x00020000UL }, /* Sector 5 - 128 KB */
    { 6u, 0x08040000UL, 0x00020000UL }, /* Sector 6 - 128 KB */
    { 7u, 0x08060000UL, 0x00020000UL }  /* Sector 7 - 128 KB (Mặc định) */
};
#define TEST_SAFE_SECTOR_COUNT (sizeof(g_SafeTestSectors) / sizeof(g_SafeTestSectors[0]))

static uint32  TestManager_CurrentGroupIndex = TEST_INVALID_INDEX;
static boolean TestManager_UartReady = FALSE;

/*===========================================================================*/
/* 1. SECTOR MANAGEMENT                                                      */
/*===========================================================================*/

boolean TestManager_SetTargetSector(uint8 sectorId)
{
    uint32 i;
    for (i = 0u; i < TEST_SAFE_SECTOR_COUNT; i++)
    {
        if (g_SafeTestSectors[i].SectorId == sectorId)
        {
            g_CurrentTestSector = g_SafeTestSectors[i];
            return TRUE;
        }
    }
    return FALSE;
}

uint8 TestManager_GetTargetSectorId(void)
{
    return g_CurrentTestSector.SectorId;
}

TestNeighborBoundsType TestManager_GetNeighborBounds(void)
{
    TestNeighborBoundsType bounds;
    bounds.HasPrev = FALSE;
    bounds.PrevTailAddress = 0u;
    bounds.HasNext = FALSE;
    bounds.NextHeadAddress = 0u;

    switch (g_CurrentTestSector.SectorId)
    {
        case 3u:
            bounds.HasPrev = TRUE;
            bounds.PrevTailAddress = 0x0800BFF0UL; /* 16 byte cuối Sector 2 */
            bounds.HasNext = TRUE;
            bounds.NextHeadAddress = 0x08010000UL; /* Đầu Sector 4 */
            break;
        case 4u:
            bounds.HasPrev = TRUE;
            bounds.PrevTailAddress = 0x0800FFF0UL; /* 16 byte cuối Sector 3 */
            bounds.HasNext = TRUE;
            bounds.NextHeadAddress = 0x08020000UL; /* Đầu Sector 5 */
            break;
        case 5u:
            bounds.HasPrev = TRUE;
            bounds.PrevTailAddress = 0x0801FFF0UL; /* 16 byte cuối Sector 4 */
            bounds.HasNext = TRUE;
            bounds.NextHeadAddress = 0x08040000UL; /* Đầu Sector 6 */
            break;
        case 6u:
            bounds.HasPrev = TRUE;
            bounds.PrevTailAddress = 0x0803FFF0UL; /* 16 byte cuối Sector 5 */
            bounds.HasNext = TRUE;
            bounds.NextHeadAddress = 0x08060000UL; /* Đầu Sector 7 */
            break;
        case 7u:
            bounds.HasPrev = TRUE;
            bounds.PrevTailAddress = 0x0805FFF0UL; /* 16 byte cuối Sector 6 */
            bounds.HasNext = FALSE;
            break;
        default:
            break;
    }

    return bounds;
}

/*===========================================================================*/
/* 2. PLATFORM & PERIPHERAL DRIVER (LED & USART2)                            */
/*===========================================================================*/

static void TestManager_LedInit(void)
{
    STM32_RCC->AHB1ENR |= STM32_RCC_AHB1ENR_GPIOAEN;
    STM32_GPIOA->MODER &= ~(0x3UL << (5u * 2u));
    STM32_GPIOA->MODER |=  (0x1UL << (5u * 2u));
    STM32_GPIOA->OTYPER &= ~(1UL << 5u);
    STM32_GPIOA->OSPEEDR &= ~(0x3UL << (5u * 2u));
    STM32_GPIOA->PUPDR &= ~(0x3UL << (5u * 2u));
    STM32_GPIOA->BSRR = (1UL << (5u + 16u));
}

static void TestManager_LedOn(void)
{
    STM32_GPIOA->BSRR = (1UL << 5u);
}

static void TestManager_LedOff(void)
{
    STM32_GPIOA->BSRR = (1UL << (5u + 16u));
}

static void TestManager_UartInit(void)
{
#if (TEST_ENABLE_UART_OUTPUT == STD_ON)
    uint32 uartDivider;

    STM32_RCC->AHB1ENR |= STM32_RCC_AHB1ENR_GPIOAEN;
    STM32_RCC->APB1ENR |= STM32_RCC_APB1ENR_USART2EN;

    STM32_GPIOA->MODER &= ~((0x3UL << (2u * 2u)) | (0x3UL << (3u * 2u)));
    STM32_GPIOA->MODER |=  ((0x2UL << (2u * 2u)) | (0x2UL << (3u * 2u)));
    STM32_GPIOA->OTYPER &= ~((1UL << 2u) | (1UL << 3u));
    STM32_GPIOA->OSPEEDR |= ((0x3UL << (2u * 2u)) | (0x3UL << (3u * 2u)));
    STM32_GPIOA->PUPDR &= ~((0x3UL << (2u * 2u)) | (0x3UL << (3u * 2u)));
    STM32_GPIOA->AFR[0] &= ~((0xFUL << (2u * 4u)) | (0xFUL << (3u * 4u)));
    STM32_GPIOA->AFR[0] |=  ((0x7UL << (2u * 4u)) | (0x7UL << (3u * 4u)));

    Stm32_BareMetalSystemCoreClockUpdate();
    uartDivider = (Stm32_SystemCoreClock + (TEST_UART_BAUDRATE / 2u)) / TEST_UART_BAUDRATE;
    if (uartDivider == 0u)
    {
        uartDivider = 1u;
    }

    STM32_USART2->CR1 = 0u;
    STM32_USART2->BRR = uartDivider;
    STM32_USART2->CR2 = 0u;
    STM32_USART2->CR3 = 0u;
    STM32_USART2->CR1 = STM32_USART_CR1_TE | STM32_USART_CR1_RE | STM32_USART_CR1_UE;

    TestManager_UartReady = TRUE;
#else
    TestManager_UartReady = FALSE;
#endif
}

static void TestManager_UartWriteChar(char c)
{
#if (TEST_ENABLE_UART_OUTPUT == STD_ON)
    if (TestManager_UartReady == TRUE)
    {
        if (c == '\n')
        {
            while ((STM32_USART2->SR & STM32_USART_SR_TXE) == 0u)
            {
            }
            STM32_USART2->DR = (uint32)((uint8)'\r');
        }

