gnaoh05/Nhom_3_FSOFT_STM32_Mem_MCAL_Generator/AUTOSAR_MEM/Test/Core/TestManager.c
        while ((STM32_USART2->SR & STM32_USART_SR_TXE) == 0u)
        {
        }
        STM32_USART2->DR = (uint32)((uint8)c);
    }
#else
    (void)c;
#endif
}

static void TestManager_UartWriteString(const char* str)
{
    if (str != NULL_PTR)
    {
        while (*str != '\0')
        {
            TestManager_UartWriteChar(*str);
            str++;
        }
    }
}

static char TestManager_UartReadCharBlocking(void)
{
#if (TEST_ENABLE_UART_OUTPUT == STD_ON)
    if (TestManager_UartReady == TRUE)
    {
        while ((STM32_USART2->SR & STM32_USART_SR_RXNE) == 0u)
        {
        }
        return (char)(STM32_USART2->DR & 0xFFu);
    }
#endif
    return '\0';
}

static void TestManager_UartFlushRx(void)
{
#if (TEST_ENABLE_UART_OUTPUT == STD_ON)
    if (TestManager_UartReady == TRUE)
    {
        while ((STM32_USART2->SR & STM32_USART_SR_RXNE) != 0u)
        {
            (void)STM32_USART2->DR;
        }
    }
#endif
}

static void TestManager_PlatformInit(void)
{
#if (TEST_ENABLE_LED_OUTPUT == STD_ON)
    TestManager_LedInit();
#endif
    TestManager_UartInit();
}

/*===========================================================================*/
/* 3. DET ERROR STATE MANAGEMENT                                             */
/*===========================================================================*/

void TestManager_ResetDetState(void)
{
    Det_ResetLastError();
}

boolean TestManager_HasDetError(void)
{
    return Det_HasError();
}

boolean TestManager_CheckDet(uint8 apiId, uint8 errorId)
{
    Det_LastErrorType lastError = Det_GetLastError();
    return ((lastError.Valid == TRUE) && (lastError.ApiId == apiId) && (lastError.ErrorId == errorId)) ? TRUE : FALSE;
}

/*===========================================================================*/
/* 4. STRING & FORMATTING LOGGERS                                            */
/*===========================================================================*/

static char TestManager_ToUpper(char c)
{
    if ((c >= 'a') && (c <= 'z'))
    {
        return (char)(c - ('a' - 'A'));
    }
    return c;
}

static const char* TestManager_GetGroupName(TestGroupType group)
{
    switch (group)
    {
        case TEST_INIT:       return "INIT";
        case TEST_DET:        return "DET";
        case TEST_STATUS:     return "STATUS";
        case TEST_READ:       return "READ";
        case TEST_WRITE:      return "WRITE";
        case TEST_ERASE:      return "ERASE";
        case TEST_BLANKCHECK: return "BLANKCHECK";
        case TEST_JOB:        return "JOB";
        case TEST_BOUNDARY:   return "BOUNDARY";
        case TEST_ALL_GROUPS: return "ALL";
        default:              return "NONE";
    }
}

static void TestManager_LogString(const char* str)
{
    TestManager_UartWriteString(str);
}

static void TestManager_LogUnsigned(uint32 value)
{
    char buf[12];
    uint32 i = 0u;

    if (value == 0u)
    {
        TestManager_UartWriteChar('0');
        return;
    }

    while (value > 0u)
    {
        buf[i++] = (char)('0' + (value % 10u));
        value /= 10u;
    }

    while (i > 0u)
    {
        TestManager_UartWriteChar(buf[--i]);
    }
}

static void TestManager_LogHex32(uint32 value)
{
    const char hexChars[] = "0123456789ABCDEF";
    int shift;

    TestManager_UartWriteString("0x");
    for (shift = 28; shift >= 0; shift -= 4)
    {
        TestManager_UartWriteChar(hexChars[(value >> (uint32)shift) & 0x0Fu]);
    }
}

static void TestManager_LogRunBanner(void)
{
    TestManager_LogString("\n========================================\n");
    TestManager_LogString("AUTOSAR MEM Test Console Ready\n");
    TestManager_LogString("Target: STM32F401RE Flash MCAL Driver\n");
    TestManager_LogString("========================================\n");
}

static void TestManager_LogCaseResult(const TestCaseReportType* caseReport, const Det_LastErrorType* detSnapshot)
{
    TestManager_LogString("  [");
    TestManager_LogString((caseReport->Result == TEST_CASE_PASS) ? "PASS" : "FAIL");
    TestManager_LogString("] ");
    TestManager_LogHex32(caseReport->CaseId);
    TestManager_LogString(" ");
    TestManager_LogString(caseReport->CaseName);
    TestManager_LogString(" (req=");
    TestManager_LogString(caseReport->RequirementIds);
    TestManager_LogString(")");

    if (caseReport->Result == TEST_CASE_FAIL)
    {
        TestManager_LogString(" expected=");
        TestManager_LogHex32(caseReport->Expected);
        TestManager_LogString(" actual=");
        TestManager_LogHex32(caseReport->Actual);
        if (caseReport->SourceFile != NULL_PTR)
        {
            TestManager_LogString(" at=");
            TestManager_LogString(caseReport->SourceFile);
            TestManager_LogString(":");
            TestManager_LogUnsigned(caseReport->SourceLine);
        }
    }

    if (detSnapshot->Valid == TRUE)
    {
        TestManager_LogString(" (det: api=");
        TestManager_LogHex32((uint32)detSnapshot->ApiId);
        TestManager_LogString(", error=");
        TestManager_LogHex32((uint32)detSnapshot->ErrorId);
        TestManager_LogString(")");
    }
    TestManager_LogString("\n");
}

static void TestManager_LogGroupSummary(const TestGroupReportType* summary)
{
    TestManager_LogString("[GROUP SUMMARY] ");
    TestManager_LogString(TestManager_GetGroupName((TestGroupType)summary->GroupId));
    TestManager_LogString(" -> total=");
    TestManager_LogUnsigned(summary->Total);
    TestManager_LogString(" passed=");
    TestManager_LogUnsigned(summary->Passed);
    TestManager_LogString(" failed=");
    TestManager_LogUnsigned(summary->Failed);
    TestManager_LogString("\n");
}

/*===========================================================================*/
/* 5. REPORT & RECORDING MANAGEMENT (GIỮ NGUYÊN CẤU TRÚC BÁO CÁO)           */
/*===========================================================================*/

static void TestManager_ResetReport(void)
{
    uint32 i;

    g_TestReport.Signature = TEST_REPORT_SIGNATURE;
    g_TestReport.Completed = FALSE;
    g_TestReport.OverallTotal = 0u;
    g_TestReport.OverallPassed = 0u;
    g_TestReport.OverallFailed = 0u;
    g_TestReport.ActiveGroup = (uint32)TEST_NONE;
    g_TestReport.LastFault = (uint32)TEST_FAULT_NONE;
    g_TestReport.FaultCfsr = 0u;
    g_TestReport.FaultHfsr = 0u;
    g_TestReport.FaultMmfar = 0u;
    g_TestReport.FaultBfar = 0u;
    g_TestReport.GroupCount = 0u;
    g_TestReport.CaseCount = 0u;
    g_TestReport.FirstFailedCaseIndex = TEST_INVALID_INDEX;
    g_TestReport.LastFailedCaseIndex = TEST_INVALID_INDEX;
    g_TestReport.DroppedCaseCount = 0u;

    for (i = 0u; i < TEST_MAX_GROUP_REPORTS; i++)
    {
        g_TestReport.GroupReports[i].GroupId = (uint32)TEST_NONE;
        g_TestReport.GroupReports[i].Total = 0u;
        g_TestReport.GroupReports[i].Passed = 0u;
        g_TestReport.GroupReports[i].Failed = 0u;
    }

    for (i = 0u; i < TEST_MAX_CASE_REPORTS; i++)
    {
        g_TestReport.CaseReports[i].Sequence = 0u;
        g_TestReport.CaseReports[i].GroupId = (uint32)TEST_NONE;
        g_TestReport.CaseReports[i].CaseId = 0u;
        g_TestReport.CaseReports[i].Result = (uint32)TEST_CASE_NOT_RUN;
        g_TestReport.CaseReports[i].Expected = 0u;
        g_TestReport.CaseReports[i].Actual = 0u;
        g_TestReport.CaseReports[i].SourceLine = 0u;
        g_TestReport.CaseReports[i].DetValid = 0u;
        g_TestReport.CaseReports[i].DetModuleId = 0u;
        g_TestReport.CaseReports[i].DetInstanceId = 0u;
        g_TestReport.CaseReports[i].DetApiId = 0u;
        g_TestReport.CaseReports[i].DetErrorId = 0u;
        g_TestReport.CaseReports[i].CaseName = "";
        g_TestReport.CaseReports[i].RequirementIds = "";
        g_TestReport.CaseReports[i].SpecPages = "";
        g_TestReport.CaseReports[i].SourceFile = "";
    }

