gnaoh05/Nhom_3_FSOFT_STM32_Mem_MCAL_Generator/AUTOSAR_MEM/Test/Core/TestManager.c
    TestManager_CurrentGroupIndex = TEST_INVALID_INDEX;
    TestManager_ResetDetState();
}

void TestManager_BeginGroup(TestGroupType group)
{
    uint32 i;

    g_TestReport.ActiveGroup = (uint32)group;
    TestManager_CurrentGroupIndex = TEST_INVALID_INDEX;

    for (i = 0u; i < g_TestReport.GroupCount; i++)
    {
        if (g_TestReport.GroupReports[i].GroupId == (uint32)group)
        {
            TestManager_CurrentGroupIndex = i;
            break;
        }
    }

    if ((TestManager_CurrentGroupIndex == TEST_INVALID_INDEX) && (g_TestReport.GroupCount < TEST_MAX_GROUP_REPORTS))
    {
        TestManager_CurrentGroupIndex = g_TestReport.GroupCount;
        g_TestReport.GroupReports[TestManager_CurrentGroupIndex].GroupId = (uint32)group;
        g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Total = 0u;
        g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Passed = 0u;
        g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Failed = 0u;
        g_TestReport.GroupCount++;
    }

    TestManager_LogString("\n[GROUP] ");
    TestManager_LogString(TestManager_GetGroupName(group));
    TestManager_LogString("\n");
}

void TestManager_EndGroup(void)
{
    if (TestManager_CurrentGroupIndex != TEST_INVALID_INDEX)
    {
        TestManager_LogGroupSummary((const TestGroupReportType*)&g_TestReport.GroupReports[TestManager_CurrentGroupIndex]);
    }
    g_TestReport.ActiveGroup = (uint32)TEST_NONE;
    TestManager_CurrentGroupIndex = TEST_INVALID_INDEX;
}

void TestManager_RecordCaseTraceAt(
    uint32 caseId,
    const char* caseName,
    const char* requirementIds,
    const char* specPages,
    boolean passed,
    uint32 expected,
    uint32 actual,
    const char* sourceFile,
    uint32 sourceLine)
{
    TestCaseReportType snapshot;
    Det_LastErrorType  detSnapshot;
    uint32             storedIndex;

    detSnapshot = Det_GetLastError();

    snapshot.Sequence = g_TestReport.OverallTotal + 1u;
    snapshot.GroupId = g_TestReport.ActiveGroup;
    snapshot.CaseId = caseId;
    snapshot.Result = (passed == TRUE) ? (uint32)TEST_CASE_PASS : (uint32)TEST_CASE_FAIL;
    snapshot.Expected = expected;
    snapshot.Actual = actual;
    snapshot.SourceLine = sourceLine;
    snapshot.DetValid = (uint32)detSnapshot.Valid;
    snapshot.DetModuleId = (uint32)detSnapshot.ModuleId;
    snapshot.DetInstanceId = (uint32)detSnapshot.InstanceId;
    snapshot.DetApiId = (uint32)detSnapshot.ApiId;
    snapshot.DetErrorId = (uint32)detSnapshot.ErrorId;
    snapshot.CaseName = (caseName != NULL_PTR) ? caseName : "";
    snapshot.RequirementIds = (requirementIds != NULL_PTR) ? requirementIds : "";
    snapshot.SpecPages = (specPages != NULL_PTR) ? specPages : "";
    snapshot.SourceFile = (sourceFile != NULL_PTR) ? sourceFile : "";

    g_TestReport.OverallTotal++;
    if (passed == TRUE)
    {
        g_TestReport.OverallPassed++;
    }
    else
    {
        g_TestReport.OverallFailed++;
    }

    if (TestManager_CurrentGroupIndex != TEST_INVALID_INDEX)
    {
        g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Total++;
        if (passed == TRUE)
        {
            g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Passed++;
        }
        else
        {
            g_TestReport.GroupReports[TestManager_CurrentGroupIndex].Failed++;
        }
    }

    if (g_TestReport.CaseCount < TEST_MAX_CASE_REPORTS)
    {
        storedIndex = g_TestReport.CaseCount;
        g_TestReport.CaseReports[storedIndex] = snapshot;
        g_TestReport.CaseCount++;

        if (passed == FALSE)
        {
            if (g_TestReport.FirstFailedCaseIndex == TEST_INVALID_INDEX)
            {
                g_TestReport.FirstFailedCaseIndex = storedIndex;
            }
            g_TestReport.LastFailedCaseIndex = storedIndex;
        }
    }
    else
    {
        g_TestReport.DroppedCaseCount++;
    }

    TestManager_LogCaseResult(&snapshot, &detSnapshot);
    TestManager_ResetDetState();
}

void TestManager_RecordCase(uint32 caseId, const char* caseName, boolean passed, uint32 expected, uint32 actual)
{
    TestManager_RecordCaseTraceAt(caseId, caseName, "", "", passed, expected, actual, NULL_PTR, 0u);
}

void TestManager_ReportFault(TestFaultType fault)
{
    g_TestReport.LastFault = (uint32)fault;
    g_TestReport.FaultCfsr = TEST_SCB_CFSR;
    g_TestReport.FaultHfsr = TEST_SCB_HFSR;
    g_TestReport.FaultMmfar = TEST_SCB_MMFAR;
    g_TestReport.FaultBfar = TEST_SCB_BFAR;

    TestManager_LogString("[FAULT] fault=");
    TestManager_LogUnsigned((uint32)fault);
    TestManager_LogString(" cfsr=");
    TestManager_LogHex32(g_TestReport.FaultCfsr);
    TestManager_LogString(" hfsr=");
    TestManager_LogHex32(g_TestReport.FaultHfsr);
    TestManager_LogString("\n");

#if (TEST_ENABLE_LED_OUTPUT == STD_ON)
    TestManager_LedOff();
#endif
}

/*===========================================================================*/
/* 6. DRIVER & HARDWARE HELPERS                                              */
/*===========================================================================*/

void TestManager_PrepareDriver(void)
{
    TestManager_ResetDetState();
    Mem_Init(NULL_PTR);
}

void TestManager_ShutdownDriver(void)
{
    Mem_DeInit();
    TestManager_ResetDetState();
}

MemAcc_MemJobResultType TestManager_ExecuteMainUntilDone(Mem_InstanceIdType instanceId, uint32 timeoutTicks)
{
    MemAcc_MemJobResultType jobResult = MEM_JOB_FAILED;
    uint32 ticks;

    for (ticks = 0u; ticks < timeoutTicks; ticks++)
    {
        Mem_MainFunction();
        jobResult = Mem_GetJobResult(instanceId);
        if (jobResult != MEM_JOB_PENDING)
        {
            break;
        }
    }

    return jobResult;
}

boolean TestManager_IsFlashTestAreaSafe(void)
{
    uint32 codeEndFlashAddress = (uint32)&_sidata + ((uint32)&_edata - (uint32)&_sdata);
    return (g_CurrentTestSector.SectorAddress >= codeEndFlashAddress) ? TRUE : FALSE;
}

boolean TestManager_EraseTestSectorAndWait(void)
{
    Std_ReturnType          retVal;
    MemAcc_MemJobResultType jobResult;

    if (TestManager_IsFlashTestAreaSafe() == FALSE)
    {
        return FALSE;
    }

