gnaoh05/Nhom_3_FSOFT_STM32_Mem_MCAL_Generator/AUTOSAR_MEM/Test/Core/TestManager.c
    retVal = Mem_Erase(TEST_FLASH_INSTANCE, g_CurrentTestSector.SectorAddress, g_CurrentTestSector.SectorLength);
    if (retVal != E_OK)
    {
        return FALSE;
    }

    jobResult = TestManager_ExecuteMainUntilDone(TEST_FLASH_INSTANCE, TEST_MAINFUNCTION_TIMEOUT);
    return (jobResult == MEM_JOB_OK) ? TRUE : FALSE;
}

void TestManager_FillPattern(Mem_DataType* buffer, Mem_LengthType length, uint8 seed)
{
    Mem_LengthType i;
    for (i = 0u; i < length; i++)
    {
        buffer[i] = (Mem_DataType)(seed + (uint8)i);
    }
}

boolean TestManager_BufferEquals(const Mem_DataType* lhs, const Mem_DataType* rhs, Mem_LengthType length)
{
    Mem_LengthType i;
    for (i = 0u; i < length; i++)
    {
        if (lhs[i] != rhs[i])
        {
            return FALSE;
        }
    }
    return TRUE;
}

void TestManager_CopyFromFlash(Mem_AddressType sourceAddress, Mem_DataType* dest, Mem_LengthType length)
{
    Mem_LengthType i;
    for (i = 0u; i < length; i++)
    {
        dest[i] = *(const volatile Mem_DataType*)((uintptr_t)sourceAddress + (uintptr_t)i);
    }
}

boolean TestManager_IsFlashRangeErased(Mem_AddressType address, Mem_LengthType length)
{
    Mem_LengthType i;
    for (i = 0u; i < length; i++)
    {
        if (*(const volatile Mem_DataType*)((uintptr_t)address + (uintptr_t)i) != (Mem_DataType)MEM_ERASED_VALUE)
        {
            return FALSE;
        }
    }
    return TRUE;
}

/*===========================================================================*/
/* 7. INTERACTIVE UART MENU & RUNNER                                         */
/*===========================================================================*/

static void TestManager_LogSectorMenu(void)
{
    TestManager_LogString("\n[MENU] Chon Sector Flash de kiem thu:\n");
    TestManager_LogString("  3 - Sector 3 (16 KB  - 0x0800C000)\n");
    TestManager_LogString("  4 - Sector 4 (64 KB  - 0x08010000)\n");
    TestManager_LogString("  5 - Sector 5 (128 KB - 0x08020000)\n");
    TestManager_LogString("  6 - Sector 6 (128 KB - 0x08040000)\n");
    TestManager_LogString("  7 - Sector 7 (128 KB - 0x08060000) [Mac dinh]\n");
    TestManager_LogString("  (*) Chu y: KHONG THE chon Sector 0, 1, 2 vi chua Code & Vector Table!\n");
    TestManager_LogString("Lua chon Sector (3-7, Enter de chon 7): ");
}

static void TestManager_SelectSectorInteractive(void)
{
    boolean valid = FALSE;

    TestManager_UartFlushRx();
    TestManager_LogSectorMenu();

    while (valid == FALSE)
    {
        char choice = TestManager_UartReadCharBlocking();

        if ((choice == '\r') || (choice == '\n'))
        {
            (void)TestManager_SetTargetSector(7u);
            TestManager_LogString("7\n[OK] Chon Sector 7 (Mac dinh - 128 KB)\n");
            valid = TRUE;
            break;
        }

        if ((choice == ' ') || (choice == '\t'))
        {
            continue;
        }

        TestManager_UartWriteChar(choice);
        TestManager_LogString("\n");

        if ((choice == '0') || (choice == '1') || (choice == '2'))
        {
            TestManager_LogString("[ERROR] Sector 0/1/2 chua Vector Table & Code dang chay! Khong hop le.\n");
            TestManager_LogString("Vui long chon lai (3-7): ");
        }
        else if ((choice >= '3') && (choice <= '7'))
        {
            uint8 sectorId = (uint8)(choice - '0');
            (void)TestManager_SetTargetSector(sectorId);
            TestManager_LogString("[OK] Da chon Sector ");
            TestManager_LogUnsigned((uint32)sectorId);
            TestManager_LogString(" (Address=");
            TestManager_LogHex32((uint32)g_CurrentTestSector.SectorAddress);
            TestManager_LogString(", Size=");
            TestManager_LogHex32((uint32)g_CurrentTestSector.SectorLength);
            TestManager_LogString(")\n");
            valid = TRUE;
        }
        else
        {
            TestManager_LogString("[ERROR] Lua chon khong hop le. Vui long chon lai (3-7): ");
        }
    }
}

static void TestManager_LogMenu(void)
{
    TestManager_LogString("\n[MENU] Select test group\n");
    TestManager_LogString("  1 - INIT\n");
    TestManager_LogString("  2 - DET\n");
    TestManager_LogString("  3 - STATUS\n");
    TestManager_LogString("  4 - READ\n");
    TestManager_LogString("  5 - WRITE (flash sector test)\n");
    TestManager_LogString("  6 - ERASE (flash sector test)\n");
    TestManager_LogString("  7 - BLANKCHECK (flash sector test)\n");
    TestManager_LogString("  8 - JOB\n");
    TestManager_LogString("  9 - BOUNDARY (neighbor isolation & edge test)\n");
    TestManager_LogString("  A - ALL GROUPS\n");
    TestManager_LogString("Choice (1-9, A): ");
}

static TestGroupType TestManager_GetMenuSelection(char choice)
{
    switch (TestManager_ToUpper(choice))
    {
        case '1': return TEST_INIT;
        case '2': return TEST_DET;
        case '3': return TEST_STATUS;
        case '4': return TEST_READ;
        case '5': return TEST_WRITE;
        case '6': return TEST_ERASE;
        case '7': return TEST_BLANKCHECK;
        case '8': return TEST_JOB;
        case '9': return TEST_BOUNDARY;
        case 'A': return TEST_ALL_GROUPS;
        default:  return TEST_NONE;
    }
}

static TestGroupType TestManager_SelectGroupInteractive(void)
{
    TestGroupType selection = TEST_NONE;

    while (selection == TEST_NONE)
    {
        char choice;

        TestManager_UartFlushRx();
        TestManager_LogMenu();

        do
        {
            choice = TestManager_UartReadCharBlocking();
        }
        while ((choice == '\r') || (choice == '\n') || (choice == ' ') || (choice == '\t'));

        TestManager_UartWriteChar(choice);
        TestManager_LogString("\n");

        selection = TestManager_GetMenuSelection(choice);
        if (selection == TEST_NONE)
        {
            TestManager_LogString("[MENU] Invalid selection. Use 1-9 or A.\n");
        }
    }

    return selection;
}

static void TestManager_RunSelectedGroup(TestGroupType group)
{
    switch (group)
    {
        case TEST_INIT:       Init_Test();       break;
        case TEST_DET:        Det_Test();        break;
        case TEST_STATUS:     Status_Test();     break;
        case TEST_READ:       Read_Test();       break;
        case TEST_WRITE:      Write_Test();      break;
        case TEST_ERASE:      Erase_Test();      break;
        case TEST_BLANKCHECK: BlankCheck_Test(); break;
        case TEST_JOB:        Job_Test();        break;
        case TEST_BOUNDARY:   Boundary_Test();   break;
        default:                                 break;
    }
}

static void TestManager_RunSelection(TestGroupType selection)
{
    if (selection == TEST_ALL_GROUPS)
    {
        TestManager_RunSelectedGroup(TEST_INIT);
        TestManager_RunSelectedGroup(TEST_DET);
        TestManager_RunSelectedGroup(TEST_STATUS);
        TestManager_RunSelectedGroup(TEST_READ);
        TestManager_RunSelectedGroup(TEST_WRITE);
        TestManager_RunSelectedGroup(TEST_ERASE);
        TestManager_RunSelectedGroup(TEST_BLANKCHECK);
        TestManager_RunSelectedGroup(TEST_JOB);
        TestManager_RunSelectedGroup(TEST_BOUNDARY);
    }
    else
    {
        TestManager_RunSelectedGroup(selection);
    }
}

void TestManager_Run(void)
{
    TestManager_PlatformInit();

