gnaoh05/Nhom_3_FSOFT_STM32_Mem_MCAL_Generator/AUTOSAR_MEM/Test/Core/TestManager.c
#if (TEST_ENABLE_UART_MENU == STD_ON) && (TEST_ENABLE_UART_OUTPUT == STD_ON)
    TestManager_LogRunBanner();
    TestManager_LogString("[MENU] Interactive UART selection is enabled.\n");

    for (;;)
    {
        TestGroupType selection = TestManager_SelectGroupInteractive();

        if ((selection == TEST_WRITE) || (selection == TEST_ERASE) ||
            (selection == TEST_BLANKCHECK) || (selection == TEST_BOUNDARY) ||
            (selection == TEST_ALL_GROUPS))
        {
            TestManager_SelectSectorInteractive();
        }

        TestManager_ResetReport();
        TestManager_LogString("[RUN] selected=");
        TestManager_LogString(TestManager_GetGroupName(selection));
        TestManager_LogString(" (Target Sector ");
        TestManager_LogUnsigned((uint32)g_CurrentTestSector.SectorId);
        TestManager_LogString(", Addr=");
        TestManager_LogHex32((uint32)g_CurrentTestSector.SectorAddress);
        TestManager_LogString(", Size=");
        TestManager_LogHex32((uint32)g_CurrentTestSector.SectorLength);
        TestManager_LogString(")\n");

        TestManager_RunSelection(selection);
        TestManager_Finish();
        TestManager_LogString("[MENU] Run complete. Select next group.\n");
    }
#else
    TestManager_ResetReport();
    TestManager_LogRunBanner();
    TestManager_RunSelection((TestGroupType)ACTIVE_TEST_GROUP);
    TestManager_Finish();
#endif
}

void TestManager_Finish(void)
{
    g_TestReport.Completed = TRUE;

    TestManager_LogString("\n[FINAL] total=");
    TestManager_LogUnsigned(g_TestReport.OverallTotal);
    TestManager_LogString(" pass=");
    TestManager_LogUnsigned(g_TestReport.OverallPassed);
    TestManager_LogString(" fail=");
    TestManager_LogUnsigned(g_TestReport.OverallFailed);
    TestManager_LogString(" fault=");
    TestManager_LogUnsigned(g_TestReport.LastFault);
    TestManager_LogString("\n");

#if (TEST_ENABLE_LED_OUTPUT == STD_ON)
    if ((g_TestReport.OverallFailed == 0u) && (g_TestReport.LastFault == (uint32)TEST_FAULT_NONE))
    {
        TestManager_LedOn();
    }
    else
    {
        TestManager_LedOff();
    }
#endif
}
